Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS2A.xml
      <value-group name="ABDACB_SCR__TXUR">
        <value name="0" caption="No effect" value="0"/>
        <value name="1" caption="Clear the Audio DAC Underrun interrupt" value="1"/>
      </value-group>
    </module>
    <module name="ACIFC" id="I7564" version="1.0.1" caption="Analog Comparator Interface">
      <register-group name="ACIFC" caption="Analog Comparator Interface">
        <register name="CTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Control Register">
          <bitfield name="EN" caption="ACIFC Enable" mask="0x1"/>
          <bitfield name="EVENTEN" caption="Peripheral Event Trigger Enable" mask="0x2"/>
          <bitfield name="USTART" caption="User Start Single Comparison" mask="0x10"/>
          <bitfield name="ESTART" caption="Peripheral Event Start Single Comparison" mask="0x20"/>
          <bitfield name="ACTEST" caption="Analog Comparator Test Mode" mask="0x80"/>
        </register>
        <register name="SR" offset="0x4" rw="R" size="4" initval="0x00000000" caption="Status Register">
          <bitfield name="ACCS0" caption="AC0 Current Comparison Status" mask="0x1"/>
          <bitfield name="ACRDY0" caption="AC0 Ready" mask="0x2"/>
          <bitfield name="ACCS1" caption="AC1 Current Comparison Status" mask="0x4"/>
          <bitfield name="ACRDY1" caption="AC1 Ready" mask="0x8"/>
          <bitfield name="ACCS2" caption="AC2 Current Comparison Status" mask="0x10"/>
          <bitfield name="ACRDY2" caption="AC2 Ready" mask="0x20"/>
          <bitfield name="ACCS3" caption="AC3 Current Comparison Status" mask="0x40"/>
          <bitfield name="ACRDY3" caption="AC3 Ready" mask="0x80"/>
          <bitfield name="ACCS4" caption="AC4 Current Comparison Status" mask="0x100"/>
          <bitfield name="ACRDY4" caption="AC4 Ready" mask="0x200"/>
          <bitfield name="ACCS5" caption="AC5 Current Comparison Status" mask="0x400"/>
          <bitfield name="ACRDY5" caption="AC5 Ready" mask="0x800"/>
          <bitfield name="ACCS6" caption="AC6 Current Comparison Status" mask="0x1000"/>
          <bitfield name="ACRDY6" caption="AC6 Ready" mask="0x2000"/>
          <bitfield name="ACCS7" caption="AC7 Current Comparison Status" mask="0x4000"/>
          <bitfield name="ACRDY7" caption="AC7 Ready" mask="0x8000"/>
          <bitfield name="WFCS0" caption="Window0 Mode Current Status" mask="0x1000000"/>
          <bitfield name="WFCS1" caption="Window1 Mode Current Status" mask="0x2000000"/>
          <bitfield name="WFCS2" caption="Window2 Mode Current Status" mask="0x4000000"/>
          <bitfield name="WFCS3" caption="Window3 Mode Current Status" mask="0x8000000"/>
        </register>
        <register name="IER" offset="0x10" rw="W" size="4" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="ACINT0" caption="AC0 Interrupt Enable" mask="0x1"/>
          <bitfield name="SUTINT0" caption="AC0 Startup Time Interrupt Enable" mask="0x2"/>
          <bitfield name="ACINT1" caption="AC1 Interrupt Enable" mask="0x4"/>
          <bitfield name="SUTINT1" caption="AC1 Startup Time Interrupt Enable" mask="0x8"/>
          <bitfield name="ACINT2" caption="AC2 Interrupt Enable" mask="0x10"/>
          <bitfield name="SUTINT2" caption="AC2 Startup Time Interrupt Enable" mask="0x20"/>
          <bitfield name="ACINT3" caption="AC3 Interrupt Enable" mask="0x40"/>
          <bitfield name="SUTINT3" caption="AC3 Startup Time Interrupt Enable" mask="0x80"/>
          <bitfield name="ACINT4" caption="AC4 Interrupt Enable" mask="0x100"/>
          <bitfield name="SUTINT4" caption="AC4 Startup Time Interrupt Enable" mask="0x200"/>
          <bitfield name="ACINT5" caption="AC5 Interrupt Enable" mask="0x400"/>
          <bitfield name="SUTINT5" caption="AC5 Startup Time Interrupt Enable" mask="0x800"/>
          <bitfield name="ACINT6" caption="AC6 Interrupt Enable" mask="0x1000"/>
          <bitfield name="SUTINT6" caption="AC6 Startup Time Interrupt Enable" mask="0x2000"/>
          <bitfield name="ACINT7" caption="AC7 Interrupt Enable" mask="0x4000"/>
          <bitfield name="SUTINT7" caption="AC7 Startup Time Interrupt Enable" mask="0x8000"/>
          <bitfield name="WFINT0" caption="Window0 Mode Interrupt Enable" mask="0x1000000"/>
          <bitfield name="WFINT1" caption="Window1 Mode Interrupt Enable" mask="0x2000000"/>
          <bitfield name="WFINT2" caption="Window2 Mode Interrupt Enable" mask="0x4000000"/>
          <bitfield name="WFINT3" caption="Window3 Mode Interrupt Enable" mask="0x8000000"/>
        </register>
        <register name="IDR" offset="0x14" rw="W" size="4" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="ACINT0" caption="AC0 Interrupt Disable" mask="0x1"/>
          <bitfield name="SUTINT0" caption="AC0 Startup Time Interrupt Disable" mask="0x2"/>
          <bitfield name="ACINT1" caption="AC1 Interrupt Disable" mask="0x4"/>
          <bitfield name="SUTINT1" caption="AC1 Startup Time Interrupt Disable" mask="0x8"/>
          <bitfield name="ACINT2" caption="AC2 Interrupt Disable" mask="0x10"/>
          <bitfield name="SUTINT2" caption="AC2 Startup Time Interrupt Disable" mask="0x20"/>
          <bitfield name="ACINT3" caption="AC3 Interrupt Disable" mask="0x40"/>
          <bitfield name="SUTINT3" caption="AC3 Startup Time Interrupt Disable" mask="0x80"/>
          <bitfield name="ACINT4" caption="AC4 Interrupt Disable" mask="0x100"/>
          <bitfield name="SUTINT4" caption="AC4 Startup Time Interrupt Disable" mask="0x200"/>
          <bitfield name="ACINT5" caption="AC5 Interrupt Disable" mask="0x400"/>
          <bitfield name="SUTINT5" caption="AC5 Startup Time Interrupt Disable" mask="0x800"/>
          <bitfield name="ACINT6" caption="AC6 Interrupt Disable" mask="0x1000"/>
          <bitfield name="SUTINT6" caption="AC6 Startup Time Interrupt Disable" mask="0x2000"/>
          <bitfield name="ACINT7" caption="AC7 Interrupt Disable" mask="0x4000"/>
          <bitfield name="SUTINT7" caption="AC7 Startup Time Interrupt Disable" mask="0x8000"/>
          <bitfield name="WFINT0" caption="Window0 Mode Interrupt Disable" mask="0x1000000"/>
          <bitfield name="WFINT1" caption="Window1 Mode Interrupt Disable" mask="0x2000000"/>
          <bitfield name="WFINT2" caption="Window2 Mode Interrupt Disable" mask="0x4000000"/>
          <bitfield name="WFINT3" caption="Window3 Mode Interrupt Disable" mask="0x8000000"/>
        </register>
        <register name="IMR" offset="0x18" rw="R" size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="ACINT0" caption="AC0 Interrupt Mask" mask="0x1"/>
          <bitfield name="SUTINT0" caption="AC0 Startup Time Interrupt Mask" mask="0x2"/>
          <bitfield name="ACINT1" caption="AC1 Interrupt Mask" mask="0x4"/>
          <bitfield name="SUTINT1" caption="AC1 Startup Time Interrupt Mask" mask="0x8"/>
          <bitfield name="ACINT2" caption="AC2 Interrupt Mask" mask="0x10"/>
          <bitfield name="SUTINT2" caption="AC2 Startup Time Interrupt Mask" mask="0x20"/>
          <bitfield name="ACINT3" caption="AC3 Interrupt Mask" mask="0x40"/>
          <bitfield name="SUTINT3" caption="AC3 Startup Time Interrupt Mask" mask="0x80"/>
          <bitfield name="ACINT4" caption="AC4 Interrupt Mask" mask="0x100"/>
          <bitfield name="SUTINT4" caption="AC4 Startup Time Interrupt Mask" mask="0x200"/>
          <bitfield name="ACINT5" caption="AC5 Interrupt Mask" mask="0x400"/>
          <bitfield name="SUTINT5" caption="AC5 Startup Time Interrupt Mask" mask="0x800"/>
          <bitfield name="ACINT6" caption="AC6 Interrupt Mask" mask="0x1000"/>
          <bitfield name="SUTINT6" caption="AC6 Startup Time Interrupt Mask" mask="0x2000"/>
          <bitfield name="ACINT7" caption="AC7 Interrupt Mask" mask="0x4000"/>
          <bitfield name="SUTINT7" caption="AC7 Startup Time Interrupt Mask" mask="0x8000"/>
          <bitfield name="WFINT0" caption="Window0 Mode Interrupt Mask" mask="0x1000000"/>
          <bitfield name="WFINT1" caption="Window1 Mode Interrupt Mask" mask="0x2000000"/>
          <bitfield name="WFINT2" caption="Window2 Mode Interrupt Mask" mask="0x4000000"/>
          <bitfield name="WFINT3" caption="Window3 Mode Interrupt Mask" mask="0x8000000"/>
        </register>
        <register name="ISR" offset="0x1c" rw="R" size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="ACINT0" caption="AC0 Interrupt Status" mask="0x1"/>
          <bitfield name="SUTINT0" caption="AC0 Startup Time Interrupt Status" mask="0x2"/>
          <bitfield name="ACINT1" caption="AC1 Interrupt Status" mask="0x4"/>
          <bitfield name="SUTINT1" caption="AC1 Startup Time Interrupt Status" mask="0x8"/>
          <bitfield name="ACINT2" caption="AC2 Interrupt Status" mask="0x10"/>
          <bitfield name="SUTINT2" caption="AC2 Startup Time Interrupt Status" mask="0x20"/>
          <bitfield name="ACINT3" caption="AC3 Interrupt Status" mask="0x40"/>
          <bitfield name="SUTINT3" caption="AC3 Startup Time Interrupt Status" mask="0x80"/>
          <bitfield name="ACINT4" caption="AC4 Interrupt Status" mask="0x100"/>
          <bitfield name="SUTINT4" caption="AC4 Startup Time Interrupt Status" mask="0x200"/>
          <bitfield name="ACINT5" caption="AC5 Interrupt Status" mask="0x400"/>
          <bitfield name="SUTINT5" caption="AC5 Startup Time Interrupt Status" mask="0x800"/>
          <bitfield name="ACINT6" caption="AC6 Interrupt Status" mask="0x1000"/>
          <bitfield name="SUTINT6" caption="AC6 Startup Time Interrupt Status" mask="0x2000"/>
          <bitfield name="ACINT7" caption="AC7 Interrupt Status" mask="0x4000"/>
          <bitfield name="SUTINT7" caption="AC7 Startup Time Interrupt Status" mask="0x8000"/>
          <bitfield name="WFINT0" caption="Window0 Mode Interrupt Status" mask="0x1000000"/>
          <bitfield name="WFINT1" caption="Window1 Mode Interrupt Status" mask="0x2000000"/>
          <bitfield name="WFINT2" caption="Window2 Mode Interrupt Status" mask="0x4000000"/>
          <bitfield name="WFINT3" caption="Window3 Mode Interrupt Status" mask="0x8000000"/>
        </register>
