Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS2A.xml
      <value-group name="IISC_MR__IMCKMODE">
        <value name="NO_IMCK" caption="No IMCK generated" value="0"/>
        <value name="IMCK" caption="IMCK generated" value="1"/>
      </value-group>
      <value-group name="IISC_MR__IWS24">
        <value name="32" caption="IWS Data Slot is 32-bit wide for DATALENGTH=18/20/24-bit" value="0"/>
        <value name="24" caption="IWS Data Slot is 24-bit wide for DATALENGTH=18/20/24-bit" value="1"/>
      </value-group>
      <value-group name="IISC_MR__MODE">
        <value name="SLAVE" caption="Slave mode (only serial data handled, clocks received from external master or controller)" value="0"/>
        <value name="MASTER" caption="Master mode (clocks generated and output by IISC, serial data handled if CR.RXEN and/or CR.TXEN written to 1)" value="1"/>
      </value-group>
      <value-group name="IISC_MR__RXDMA">
        <value name="SINGLE" caption="Single DMA channel" value="0"/>
        <value name="MULTIPLE" caption="One DMA channel per data channel" value="1"/>
      </value-group>
      <value-group name="IISC_MR__RXLOOP">
        <value name="OFF" caption="Normal mode" value="0"/>
        <value name="ON" caption="ISDO internally connected to ISDI" value="1"/>
      </value-group>
      <value-group name="IISC_MR__RXMONO">
        <value name="STEREO" caption="Normal mode" value="0"/>
        <value name="MONO" caption="Left channel data is duplicated to right channel" value="1"/>
      </value-group>
      <value-group name="IISC_MR__TXDMA">
        <value name="SINGLE" caption="Single DMA channel" value="0"/>
        <value name="MULTIPLE" caption="One DMA channel per data channel" value="1"/>
      </value-group>
      <value-group name="IISC_MR__TXMONO">
        <value name="STEREO" caption="Normal mode" value="0"/>
        <value name="MONO" caption="Left channel data is duplicated to right channel" value="1"/>
      </value-group>
      <value-group name="IISC_MR__TXSAME">
        <value name="ZERO" caption="Zero data transmitted in case of underrun" value="0"/>
        <value name="SAME" caption="Last data transmitted in case of underrun" value="1"/>
      </value-group>
      <value-group name="IISC_SR__RXEN">
        <value name="OFF" caption="Receiver is effectively disabled, following a CR.RXDIS or CR.SWRST request" value="0"/>
        <value name="ON" caption="Receiver is effectively enabled, following a CR.RXEN request" value="1"/>
      </value-group>
      <value-group name="IISC_SR__RXOR">
        <value name="NO" caption="No overrun" value="0"/>
        <value name="YES" caption="The previous received data has not been read. This data is lost" value="1"/>
      </value-group>
      <value-group name="IISC_SR__RXORCH">
        <value name="LEFT" caption="Overrun first occurred on left channel" value="0"/>
        <value name="RIGHT" caption="Overrun first occurred on right channel" value="1"/>
      </value-group>
      <value-group name="IISC_SR__RXRDY">
        <value name="EMPTY" caption="The register RHR is empty and can't be read" value="0"/>
        <value name="FULL" caption="The register RHR is full and is ready to be read" value="1"/>
      </value-group>
      <value-group name="IISC_SR__TXEN">
        <value name="OFF" caption="Transmitter is effectively disabled, following a CR.TXDIS or CR.SWRST request" value="0"/>
        <value name="ON" caption="Transmitter is effectively enabled, following a CR.TXEN request" value="1"/>
      </value-group>
      <value-group name="IISC_SR__TXRDY">
        <value name="FULL" caption="The register THR is full and can't be written" value="0"/>
        <value name="EMPTY" caption="The register THR is empty and is ready to be written" value="1"/>
      </value-group>
      <value-group name="IISC_SR__TXUR">
        <value name="NO" caption="No underrun" value="0"/>
        <value name="YES" caption="The last bit of the last data written to the register THR has been set. Until the next write to THR, data will be sent according to MR.TXSAME field" value="1"/>
      </value-group>
      <value-group name="IISC_SR__TXURCH">
        <value name="LEFT" caption="Underrun first occurred on left channel" value="0"/>
        <value name="RIGHT" caption="Underrun first occurred on right channel" value="1"/>
      </value-group>
      <value-group name="IISC_SCR__RXOR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="CLEAR" caption="Clears the corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_SCR__TXUR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="CLEAR" caption="Clears the corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_SSR__RXOR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="SET" caption="Sets corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_SSR__TXUR">
        <value name="NO" caption="No effect" value="0"/>
        <value name="SET" caption="Sets corresponding SR bit" value="1"/>
      </value-group>
      <value-group name="IISC_IER__RXOR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IER__RXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IER__TXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IER__TXUR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Enables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__RXOR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__RXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__TXRDY">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IDR__TXUR">
        <value name="OFF" caption="No effect" value="0"/>
        <value name="ON" caption="Disables the corresponding interrupt" value="1"/>
      </value-group>
      <value-group name="IISC_IMR__RXOR">
        <value name="DISABLED" caption="The corresponding interrupt is disabled" value="0"/>
        <value name="ENABLED" caption="The corresponding interrupt is enabled" value="1"/>
      </value-group>
