Fasten90/FastenTerminal/bin/Debug/JarKon/Atmel/devices/ATSAM4LS2A.xml
        <register name="UECON1SET" offset="0x1f4" rw="W" size="4" initval="0x00000000" caption="Endpoint Control Set Register">
          <bitfield name="TXINES" caption="TXINE Set" mask="0x1"/>
          <bitfield name="RXOUTES" caption="RXOUTE Set" mask="0x2"/>
          <bitfield name="RXSTPES" caption="RXSTPE Set" mask="0x4"/>
          <bitfield name="NAKOUTES" caption="NAKOUTE Set" mask="0x8"/>
          <bitfield name="NAKINES" caption="NAKINE Set" mask="0x10"/>
          <bitfield name="STALLEDES" caption="STALLEDE Set" mask="0x40"/>
          <bitfield name="NREPLYS" caption="NREPLY Set" mask="0x100"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x800"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="KILLBKS" caption="KILLBK Set" mask="0x2000"/>
          <bitfield name="NYETDISS" caption="NYETDIS Set" mask="0x20000"/>
          <bitfield name="RSTDTS" caption="RSTDT Set" mask="0x40000"/>
          <bitfield name="STALLRQS" caption="STALLRQ Set" mask="0x80000"/>
          <bitfield name="BUSY0S" caption="BUSY0 Set" mask="0x1000000"/>
          <bitfield name="BUSY1S" caption="BUSY1 Set" mask="0x2000000"/>
        </register>
        <register name="UECON2SET" offset="0x1f8" rw="W" size="4" initval="0x00000000" caption="Endpoint Control Set Register">
          <bitfield name="TXINES" caption="TXINE Set" mask="0x1"/>
          <bitfield name="RXOUTES" caption="RXOUTE Set" mask="0x2"/>
          <bitfield name="RXSTPES" caption="RXSTPE Set" mask="0x4"/>
          <bitfield name="NAKOUTES" caption="NAKOUTE Set" mask="0x8"/>
          <bitfield name="NAKINES" caption="NAKINE Set" mask="0x10"/>
          <bitfield name="STALLEDES" caption="STALLEDE Set" mask="0x40"/>
          <bitfield name="NREPLYS" caption="NREPLY Set" mask="0x100"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x800"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="KILLBKS" caption="KILLBK Set" mask="0x2000"/>
          <bitfield name="NYETDISS" caption="NYETDIS Set" mask="0x20000"/>
          <bitfield name="RSTDTS" caption="RSTDT Set" mask="0x40000"/>
          <bitfield name="STALLRQS" caption="STALLRQ Set" mask="0x80000"/>
          <bitfield name="BUSY0S" caption="BUSY0 Set" mask="0x1000000"/>
          <bitfield name="BUSY1S" caption="BUSY1 Set" mask="0x2000000"/>
        </register>
        <register name="UECON3SET" offset="0x1fc" rw="W" size="4" initval="0x00000000" caption="Endpoint Control Set Register">
          <bitfield name="TXINES" caption="TXINE Set" mask="0x1"/>
          <bitfield name="RXOUTES" caption="RXOUTE Set" mask="0x2"/>
          <bitfield name="RXSTPES" caption="RXSTPE Set" mask="0x4"/>
          <bitfield name="NAKOUTES" caption="NAKOUTE Set" mask="0x8"/>
          <bitfield name="NAKINES" caption="NAKINE Set" mask="0x10"/>
          <bitfield name="STALLEDES" caption="STALLEDE Set" mask="0x40"/>
          <bitfield name="NREPLYS" caption="NREPLY Set" mask="0x100"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x800"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="KILLBKS" caption="KILLBK Set" mask="0x2000"/>
          <bitfield name="NYETDISS" caption="NYETDIS Set" mask="0x20000"/>
          <bitfield name="RSTDTS" caption="RSTDT Set" mask="0x40000"/>
          <bitfield name="STALLRQS" caption="STALLRQ Set" mask="0x80000"/>
          <bitfield name="BUSY0S" caption="BUSY0 Set" mask="0x1000000"/>
          <bitfield name="BUSY1S" caption="BUSY1 Set" mask="0x2000000"/>
        </register>
        <register name="UECON4SET" offset="0x200" rw="W" size="4" initval="0x00000000" caption="Endpoint Control Set Register">
          <bitfield name="TXINES" caption="TXINE Set" mask="0x1"/>
          <bitfield name="RXOUTES" caption="RXOUTE Set" mask="0x2"/>
          <bitfield name="RXSTPES" caption="RXSTPE Set" mask="0x4"/>
          <bitfield name="NAKOUTES" caption="NAKOUTE Set" mask="0x8"/>
          <bitfield name="NAKINES" caption="NAKINE Set" mask="0x10"/>
          <bitfield name="STALLEDES" caption="STALLEDE Set" mask="0x40"/>
          <bitfield name="NREPLYS" caption="NREPLY Set" mask="0x100"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x800"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="KILLBKS" caption="KILLBK Set" mask="0x2000"/>
          <bitfield name="NYETDISS" caption="NYETDIS Set" mask="0x20000"/>
          <bitfield name="RSTDTS" caption="RSTDT Set" mask="0x40000"/>
          <bitfield name="STALLRQS" caption="STALLRQ Set" mask="0x80000"/>
          <bitfield name="BUSY0S" caption="BUSY0 Set" mask="0x1000000"/>
          <bitfield name="BUSY1S" caption="BUSY1 Set" mask="0x2000000"/>
        </register>
        <register name="UECON5SET" offset="0x204" rw="W" size="4" initval="0x00000000" caption="Endpoint Control Set Register">
          <bitfield name="TXINES" caption="TXINE Set" mask="0x1"/>
          <bitfield name="RXOUTES" caption="RXOUTE Set" mask="0x2"/>
          <bitfield name="RXSTPES" caption="RXSTPE Set" mask="0x4"/>
          <bitfield name="NAKOUTES" caption="NAKOUTE Set" mask="0x8"/>
          <bitfield name="NAKINES" caption="NAKINE Set" mask="0x10"/>
          <bitfield name="STALLEDES" caption="STALLEDE Set" mask="0x40"/>
          <bitfield name="NREPLYS" caption="NREPLY Set" mask="0x100"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x800"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="KILLBKS" caption="KILLBK Set" mask="0x2000"/>
          <bitfield name="NYETDISS" caption="NYETDIS Set" mask="0x20000"/>
          <bitfield name="RSTDTS" caption="RSTDT Set" mask="0x40000"/>
          <bitfield name="STALLRQS" caption="STALLRQ Set" mask="0x80000"/>
          <bitfield name="BUSY0S" caption="BUSY0 Set" mask="0x1000000"/>
          <bitfield name="BUSY1S" caption="BUSY1 Set" mask="0x2000000"/>
        </register>
        <register name="UECON6SET" offset="0x208" rw="W" size="4" initval="0x00000000" caption="Endpoint Control Set Register">
          <bitfield name="TXINES" caption="TXINE Set" mask="0x1"/>
          <bitfield name="RXOUTES" caption="RXOUTE Set" mask="0x2"/>
          <bitfield name="RXSTPES" caption="RXSTPE Set" mask="0x4"/>
          <bitfield name="NAKOUTES" caption="NAKOUTE Set" mask="0x8"/>
          <bitfield name="NAKINES" caption="NAKINE Set" mask="0x10"/>
          <bitfield name="STALLEDES" caption="STALLEDE Set" mask="0x40"/>
          <bitfield name="NREPLYS" caption="NREPLY Set" mask="0x100"/>
          <bitfield name="RAMACERES" caption="RAMACERE Set" mask="0x800"/>
          <bitfield name="NBUSYBKES" caption="NBUSYBKE Set" mask="0x1000"/>
          <bitfield name="KILLBKS" caption="KILLBK Set" mask="0x2000"/>
          <bitfield name="NYETDISS" caption="NYETDIS Set" mask="0x20000"/>
          <bitfield name="RSTDTS" caption="RSTDT Set" mask="0x40000"/>
          <bitfield name="STALLRQS" caption="STALLRQ Set" mask="0x80000"/>
          <bitfield name="BUSY0S" caption="BUSY0 Set" mask="0x1000000"/>
          <bitfield name="BUSY1S" caption="BUSY1 Set" mask="0x2000000"/>
        </register>
